# 03. 판다스 데이터프레임과 시리즈
## 03-1. 나만의 데이터 만들기

In [1]:
import pandas as pd
import os
from collection import OrderedDict
import random

In [3]:
os.chdir('C:\\Users\\user\\Documents\\GitHub\\doit_pandas\\data')
os.getcwd()

'C:\\Users\\user\\Documents\\GitHub\\doit_pandas\\data'

In [4]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [5]:
s_index = pd.Series(['Wes McKinney', 'Creator of Pandas'], index = ['Person', 'Who'])
s_index

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [6]:
scientists = pd.DataFrame({'Name' : ['Rosaline Franklin', 'William Gosset'],
                           'Occupation' : ['Chemist', 'Statistician'],
                           'Born' : ['1920-07-25', '1876-06-13'],
                           'Died' : ['1958-04-16', '1937-10-16'],
                           'Age' : [37, 61]})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [7]:
scientists_index = pd.DataFrame({'Occupation' : ['Chemist', 'Statistician'],
                                 'Born' : ['1920-07-25', '1876-06-13'],
                                 'Died' : ['1958-04-16', '1937-10-16'],
                                 'Age' : [37, 61]}, 
                                index = ['Rosaline Franklin', 'William Gosset'],
                                columns = ['Occupation', 'Born', 'Age', 'Died'])
scientists_index

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [8]:
from collections import OrderedDict

In [11]:
scientists_ordered = pd.DataFrame(OrderedDict([('Name', ['Rosaline Franklin', 'William Gosset']),
                                       ('Occupation', ['Chemist', 'Statistician']),
                                       ('Born', ['1920-07-25', '1876-06-13']),
                                       ('Died', ['1958-04-16', '1937-10-16']),
                                       ('Age', [37, 61])]))
scientists_ordered

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

## 03-2. 시리즈 다루기 - 기초

In [13]:
scientists = pd.DataFrame({'Occupation' : ['Chemist', 'Statistician'],
                           'Born' : ['1920-07-25', '1876-06-13'],
                           'Died' : ['1958-04-16', '1937-10-16'],
                           'Age' : [37, 61]}, 
                          index = ['Rosaline Franklin', 'William Gosset'],
                          columns = ['Occupation', 'Born', 'Died', 'Age'])
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [14]:
first_row = scientists.loc['William Gosset']
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

In [24]:
type(first_row)

pandas.core.series.Series

In [25]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [27]:
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [28]:
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [29]:
first_row.index[0]

'Occupation'

In [30]:
first_row.keys()[0]

'Occupation'

In [32]:
ages = scientists['Age']
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [33]:
ages.mean()

49.0

In [34]:
ages.min()

37

In [35]:
ages.max()

61

In [36]:
ages.std()

16.97056274847714

In [40]:
ages.describe()

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

In [42]:
ages.info()

<class 'pandas.core.series.Series'>
Index: 2 entries, Rosaline Franklin to William Gosset
Series name: Age
Non-Null Count  Dtype
--------------  -----
2 non-null      int64
dtypes: int64(1)
memory usage: 140.0+ bytes

In [44]:
ages.drop_duplicates()

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [54]:
ages.isin([37])

Rosaline Franklin     True
William Gosset       False
Name: Age, dtype: bool

In [55]:
ages.sample()

William Gosset    61
Name: Age, dtype: int64

In [58]:
ages.to_frame()

                   Age
Rosaline Franklin   37
William Gosset      61

## 03-3. 시리즈 다루기 - 응용

In [60]:
scientists_raw = pd.read_csv('scientists.csv')
scientists = scientists_raw.copy()
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [61]:
scientists.shape

(8, 5)

In [62]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [63]:
scientists.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [67]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [65]:
ages.max()

90

In [66]:
ages.mean()

59.125

In [68]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [69]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [75]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [70]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [73]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [74]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [76]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [77]:
tmp = pd.Series([1, 100])
tmp

0      1
1    100
dtype: int64

In [78]:
ages + tmp

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [79]:
ages.sort_index()

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [85]:
rev_ages = ages.sort_index(ascending = False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [86]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [87]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

## 03-4. 데이터프레임 다루기

In [88]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [91]:
scientists.loc[[True, True, False, True, False, False, True, False]]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician
3        Marie Curie  1867-11-07  1934-07-04   66             Chemist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [92]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

## 03-5. 시리즈와 데이터프레임의 데이터 처리하기

In [102]:
scientists['Born'].dtype

dtype('O')

In [103]:
print(scientists['Born'].dtype)

object

In [104]:
print(scientists['Died'].dtype)

object

In [106]:
born_datetime = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [109]:
died_datetime = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [110]:
print(born_datetime.dtype)

datetime64[ns]

In [111]:
print(died_datetime.dtype)

datetime64[ns]

In [112]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [114]:
scientists.shape

(8, 7)

In [115]:
scientists['age_days_dt'] = scientists['died_dt'] - scientists['born_dt']
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [122]:
scientists['Age']

0    66
1    37
2    41
3    90
4    61
5    45
6    56
7    77
Name: Age, dtype: int64

In [117]:
import random

In [118]:
random.seed(42)

In [124]:
random.shuffle(scientists['Age'])

In [123]:
scientists['Age']

0    66
1    37
2    41
3    90
4    61
5    45
6    56
7    77
Name: Age, dtype: int64

In [125]:
scientists['Age']

0    41
1    37
2    66
3    77
4    61
5    56
6    45
7    90
Name: Age, dtype: int64

In [126]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [129]:
scientists_dropped = scientists.drop(['Age'], axis = 1)
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [133]:
scientists_dropped.drop(columns = 'Born')

,Name,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

## 03-6. 데이터 저장하고 불러오기

In [134]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [135]:
names.to_pickle('scientists_names_series.pickle')

In [136]:
scientists.to_pickle('scientists_df.pickle')

In [138]:
scientists_names_from_pickle = pd.read_pickle('scientists_names_series.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [139]:
scientists_from_pickle = pd.read_pickle('scientists_df.pickle')
scientists_from_pickle

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,41,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,37,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,66,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,56,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,45,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,90,Mathematician,1777-04-30,1855-02-23,28422 days

In [140]:
names.to_csv('scientists_names_series.csv')

In [141]:
names.to_csv('scientists_names_series.tsv', sep = '\t')

In [143]:
scientists.to_csv('scientists_df.csv')

In [144]:
scientists.to_csv('scientists_df.tsv', sep = '\t')

In [145]:
scientists.to_csv('scientists_df2.csv', index = False)

In [146]:
# 데이터프레임을 .xls 파일로 저장 (단, 이제는 패키지가 유지보수가 안됨)
# (cmd) pip install xlwt

# 데이터프레임을 .xlsx 파일로 저장
# (cmd) pip install openpyxl

In [150]:
import xlwt
import openpyxl

In [147]:
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [148]:
names_df = names.to_frame()

In [149]:
names_df

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss

In [151]:
names_df.to_excel('scientists_names_series_df.xls')

C:\Users\user\AppData\Local\Temp\ipykernel_23668\2568600664.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('scientists_names_series_df.xls')

In [152]:
names_df.to_excel('scientists_names_series_df.xlsx')